app/views/questions/index.html.erb

SELECT "questions".* FROM "questions"
---
              <p class="prof_sm_text">Location: <%= question.user.location %></p>
              <p class="prof_sm_text">Questions: <%= question.user.questions.count %></p>