app/views/questions/show.html.erb

      <div id ="answer-box">
         <% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]