app/views/index/index.html.erb

      <div class="col-sm-1 arguments">
        <p><%= question.answers.count %></p>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]