app/views/users/show.html.erb

	        <br>
	        <p><%= question.answers.count %></p>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]