app/controllers/questions_controller.rb

  def show
    @question = Question.find_by(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE (1) LIMIT 1