app/controllers/questions_controller.rb

  def create
    @user = User.find_by(id: session[:id])
    @question = Question.new(question_params.merge({user: @user}))

    if @question.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aeraer"], ["body", "jose"], ["created_at", "2015-04-09 16:15:03.758823"], ["updated_at", "2015-04-09 16:15:03.758823"]]

  def show
    @question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 12]]

  def destroy
    @question = Question.find_by(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE (1) LIMIT 1
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]