app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = ? LIMIT 5  [["user_id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."user_id" = ? LIMIT 5  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @questions = @user.questions.take(5)
    @answers = @user.answers.take(5)